
const texts = {
  1: `السينما مالي
وتبقى الحيرة بكل مرة اشوفج بيها
وين اباوع؟
عينج؟ تنسيني كلامي
شفتج؟ تجيب لعقلي افكار شيطانية
خدودج؟ تخليني اعنفج واكرصهن
خشمج؟ يجيني شعور اريد ابوسة
حواجبج؟ الاثار؟
حتى حبوب وجهج احبهن
جديات حيرة
لهل سبب هو اكثر منظر اريد اشاهده بحياتي.`,
  2: `bir kara kasin bir kara gozun Degier dunya malina.

شعوري : الشي الوحيد الي احس مهما اتلمسهن وابوسهن اريد بعد هن عيونج وحواجبج

رجل وما استسلمْتُ قَبلُ لفارسٍ
مالي أمام عيونها مستسلِمُ؟🙂`,
  3: `My slime
جزئي المفضل ولعبة اصابعي الجميلة 
من خليتي خدج وتحسستي خدي 
جان شعوري انو بس ردت الزمن 
يوكف
وهيج مثلا ابوس فد المليار خلية الي بخدج خلية خلية`,
  4: `My strawberry🔥`,
  5: `لديها ضحكة... لو رأتها فراشة لطال عمرها.

شعوري : كلشي مو زين يسكت من اشوفج تضحكين هاهي ماعندي شي اقلق عليه بعد احس روحي وصلت بر الامان مثل ما ابتسمتي هسة🫰🏻`,
  6: `Sesin هو لحن المستقبل

اطلبة طلب مستقبلي لان ميكفي اخذ صوتج عن طريق السمع بس انما الموضوع صار لازم يتحول عن طريق الفم ايضا
من الامور الي تضحكني بدون سبب
صوتج وانتِ توج كاعدة
من تثاوبين اوووووووف
من تعطسين
من تحجين وي نفسج بصوت ناصي
اريد طلبي🙂`,
  7: `عشقي من الدنيا
ما اكول غير بس bana ellerini ver

شعوري : تحفة فنية وعمل هندسي عظيم
بهيج شي صغيروني وكيوت وينكرط ويخليني اكزكز واعضعض كلشي مر عليها انجرحت بيوم من الايام ومسحت الدموع مرة وصفكت مرة وركصت مرة واشتغلت وكتبت ولزمت كومة امور حلوة ومو حلوة واثار القصص العاشتها ايدج كلهن موجودات بايدج وعورات واثار كل ذني لازم تتلطخ ايدج وتتعب وتكون جزء منهك مو حلو بس رغم كل هذا بقت بهيج لطافة وجمال ورقة ونعومة
كل الحب والعشق الها

شرايينج عظامج ايدج اظافرج اثار ايدج كلهن مسكرنات بعقلي
ف bana ellerini ver`,
  8: `هو عادي تدخلين مساحتي الشخصية حتى نصير مساحة وحدة بجسمين؟
جلدج جان اعظم شي لمستة بعمري كاملا واعني هذا كلامي جدا
 جلدج وسيلة لتوصيل مشاعري لان اني متيقن اكو شي منشوفة ينقل بيني وبينج عن طريق الجلد

جلدج♥️`,
  9: `ال O2 مالي
عطر متشبع بجلدج وبهدومج ودا اطببة لجسمي
اتنفس عطرج بالقدر الي اريدج تكونين بداخلي لحد ما بعد رئتي متسحب هوا تقفل
يعني اتمنى كلج تكونين عطر بالنسبة الي حتى ادخلج بية
بس تبقى هل خاصية بس العطر يوفرها`,
  10: `الشي الي يحسسني انتِ ماي بيبي الصغيرونة وهلشي يخليني اكرطج انتِ بعيوني معندج شي مال كبار كلشي ما اطفال ف كلشي بيج ينكرط من جوا ليفوك شعوري من مددتي علية مستحيل اكدر اوصفة بس جان شي يستحق اسكت...`,
  11: `شايفة من طفل ينام ع جتفج؟
شايفة شعورج انو تخافين تتنفسين زايد وتزعجي
تعرفين شنو شعور الراحة والطمأنينة والسلام الداخلي الي احس بي شنو؟ 
انو شخص يقرر ينام ع جتفك لان امن بيك وسلمك راحتة واستند عليك ونام هلشي مو موقف عادي ابد 
انو مسؤولية بحد ذاتها وسعادة وراحة نفسية جدا رفيعة

حنطيج سر عميق جدا اتمنى تنسي ورا متقري
هو هذا سبب حبي للسينما👀`,
  12: `Sacini dok sineme

لعبتي المستقبلية
والفاليوم مالتي حتى انام بالمستقبل
ممنوع تلزمي بعدين
اني اشسورة الج واني امشطة الج واني انشفة الج واني المة الج 
هواي حتنفس بي مستقبلا

وحلكة كومة فراشات يتنفسن بي قبلي🦋`
};
function showText(index) {
  if (texts[index]) {
    document.getElementById("popup-title").innerText = index;
    document.getElementById("popup-text").innerText = texts[index];
    document.getElementById("overlay").style.display = "flex";
  }
}
function closeOverlay() {
  document.getElementById("overlay").style.display = "none";
}
